[AdventPathfinderCaptainArmor X2ArmorTemplate]
FriendlyName="ADVENT Pathfinder Hunter Armor"
FriendlyNamePlural="ADVENT Pathfinder Hunter Armors"
BriefSummary="The ADVENT Pathfinder Hunter is a fast recon unit with thicker armor than the standard Pathfinder. They excel in pulling off aggressive flanking maneuvers."
TacticalText="<Bullet/> Soldiers may take advantage of scavenged ADVENT Pathfinder Hunter gear in combat. Additionally, we may catch our enemy off guard with this new armor."

[AdventPathfinderCaptainArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."

[AdventPathfinderCaptainArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Apex Stalker"
LocLongDescription="The ADVENT Pathfinder Hunter's armor offers the same increased mobility as the regular Pathfinder's, as well as better health and armor bonuses."
LocHelpText="The ADVENT Pathfinder Hunter's armor offers the same increased mobility as the regular Pathfinder's, as well as better health and armor bonuses."
LocFlyOverText="The ADVENT Pathfinder Hunter's armor offers the same increased mobility as the regular Pathfinder's, as well as better health and armor bonuses."
LocPromotionPopupText="<Bullet/> The ADVENT Pathfinder Hunter's armor offers the same increased mobility as the regular Pathfinder's, as well as better health and armor bonuses."
